#!/usr/bin/ruby
# coding: utf-8

#
# データ元
# https://www.e-stat.go.jp/stat-search/files?page=1&layout=datalist&toukei=00200524&tstat=000000090001&cycle=1&tclass1=000001011678&cycle_facet=tclass1&tclass2val=0
#
# 2023000606,総人口,2023年6月1日現在（概算値）,うち85歳以上,割合,％,5.4,3.6,7.1
# 2023000101,総人口,2023年1月1日現在（確定値）,総数,人口,千人,124752,60658,64094
# 2023000101,総人口,2023年1月1日現在（確定値）,0歳～4歳,人口,千人,4210,2155,2055
# 2023000101,総人口,2023年1月1日現在（確定値）,5歳～9歳,人口,千人,4925,2523,2402
# 2023000101,総人口,2023年1月1日現在（確定値）,10歳～14歳,人口,千人,5298,2714,2583
# 2023000101,総人口,2023年1月1日現在（確定値）,15歳～19歳,人口,千人,5518,2832,2686
# 2023000101,総人口,2023年1月1日現在（確定値）,20歳～24歳,人口,千人,6259,3213,3045
# 2023000101,総人口,2023年1月1日現在（確定値）,25歳～29歳,人口,千人,6401,3287,3115
# 2023000101,総人口,2023年1月1日現在（確定値）,30歳～34歳,人口,千人,6413,3282,3131
# 2023000101,総人口,2023年1月1日現在（確定値）,35歳～39歳,人口,千人,7168,3648,3521
# 2023000101,総人口,2023年1月1日現在（確定値）,40歳～44歳,人口,千人,7900,4005,3896
# 2023000101,総人口,2023年1月1日現在（確定値）,45歳～49歳,人口,千人,9388,4755,4633
# 2023000101,総人口,2023年1月1日現在（確定値）,50歳～54歳,人口,千人,9496,4788,4708
# 2023000101,総人口,2023年1月1日現在（確定値）,55歳～59歳,人口,千人,8132,4065,4068
# 2023000101,総人口,2023年1月1日現在（確定値）,60歳～64歳,人口,千人,7470,3697,3773
# 2023000101,総人口,2023年1月1日現在（確定値）,65歳～69歳,人口,千人,7467,3632,3835
# 2023000101,総人口,2023年1月1日現在（確定値）,70歳～74歳,人口,千人,9217,4347,4870
# 2023000101,総人口,2023年1月1日現在（確定値）,75歳～79歳,人口,千人,7135,3202,3933
# 2023000101,総人口,2023年1月1日現在（確定値）,80歳～84歳,人口,千人,5735,2388,3346
# 2023000101,総人口,2023年1月1日現在（確定値）,85歳～89歳,人口,千人,3968,1436,2532
# 2023000101,総人口,2023年1月1日現在（確定値）,90歳～94歳,人口,千人,2002,566,1436
# 2023000101,総人口,2023年1月1日現在（確定値）,95歳～99歳,人口,千人,564,113,451
# 2023000101,総人口,2023年1月1日現在（確定値）,100歳以上,人口,千人,87,10,76
# 2023000101,総人口,2023年1月1日現在（確定値）,15歳未満,人口,千人,14433,7392,7040
# 2023000101,総人口,2023年1月1日現在（確定値）,15歳～64歳,人口,千人,74146,37571,36575
# 2023000101,総人口,2023年1月1日現在（確定値）,65歳以上,人口,千人,36173,15695,20479
# 2023000101,総人口,2023年1月1日現在（確定値）,うち75歳以上,人口,千人,19489,7716,11774
# 2023000101,総人口,2023年1月1日現在（確定値）,うち85歳以上,人口,千人,6620,2125,4495
# 2023000101,総人口,2023年1月1日現在（確定値）,15歳未満,割合,％,11.6,12.2,11
# 2023000101,総人口,2023年1月1日現在（確定値）,15歳～64歳,割合,％,59.4,61.9,57.1
# 2023000101,総人口,2023年1月1日現在（確定値）,65歳以上,割合,％,29,25.9,32
# 2023000101,総人口,2023年1月1日現在（確定値）,うち75歳以上,割合,％,15.6,12.7,18.4
# 2023000101,総人口,2023年1月1日現在（確定値）,うち85歳以上,割合,％,5.3,3.5,7
# 2023000101,日本人人口,2023年1月1日現在（確定値）,総数,人口,千人,121893,59245,62647

require 'pp'
require 'csv'
require 'date'
require 'json'
require_relative 'mstats2026'

$health = Hash.new

$sexes = { '男' => 'male', '女' => 'female', '男女計' => 'both' }
$ages = {
    '総数' => 'age_all',
    '0歳～4歳' => 'age_00_04',
    '5歳～9歳' => 'age_05_09',
    '10歳～14歳' => 'age_10_14',
    '15歳～19歳' => 'age_15_19',
    '20歳～24歳' => 'age_20_24',
    '25歳～29歳' => 'age_25_29',
    '30歳～34歳' => 'age_30_34',
    '35歳～39歳' => 'age_35_39',
    '40歳～44歳' => 'age_40_44',
    '45歳～49歳' => 'age_45_49',
    '50歳～54歳' => 'age_50_54',
    '55歳～59歳' => 'age_55_59',
    '60歳～64歳' => 'age_60_64',
    '65歳～69歳' => 'age_65_69',
    '70歳～74歳' => 'age_70_74',
    '75歳～79歳' => 'age_75_79',
    '80歳～84歳' => 'age_80_84',
    '85歳～89歳' => 'age_85_89',
    '90歳～94歳' => 'age_90_94',
    '95歳～99歳' => 'age_95_99',
    '100歳以上' => 'age_100over',
    '85歳以上' => 'age_85over',
}

ARGV.each do |file|
    $firstflag = true
    csvtext = ''
    year = month = 0
    date = nil

    year1 = month1 = year2 = month2 = 0
    $flipflag = false
    File.foreach(file) do |line|
        next if line =~ /外国人人口/ # 2025-04.csv から
        line = line.tr('０-９', '0-9').gsub(/\(/, '（').gsub(/\)/, '）').gsub(/〜/, '～')
        line = line.gsub(/ |　/, '') if line =~ /平.*成/
        if line =~ /平成(\d+)年(\d+)月(\d+)日現在.*確定値.*平成(\d+)年(\d+)月(\d+)日現在/
            line.sub(/平成(\d+)年(\d+)月(\d+)日現在.*平成(\d+)年(\d+)月(\d+)日現在/) do
                $flipflag = true
                year2 = ($1.to_i + 1988).to_s
                month2 = $2
                year1 = ($4.to_i + 1988).to_s
                month1 = $5
            end
            STDERR.puts "#{file}: #{$1}:#{year1}-#{month1}, #{$4}:#{year2}-#{month2}"
        elsif line =~ /平成(\d+)年(\d+)月(\d+)日現在.*概算値.*平成(\d+)年(\d+)月(\d+)日現在/
            line.sub(/平成(\d+)年(\d+)月(\d+)日現在.*平成(\d+)年(\d+)月(\d+)日現在/) do
                year1 = ($1.to_i + 1988).to_s
                month1 = $2
                year2 = ($4.to_i + 1988).to_s
                month2 = $5
            end
            STDERR.puts "#{file}: #{$1}:#{year1}-#{month1}, #{$4}:#{year2}-#{month2}"
        elsif line =~ /(\d+)年(\d+)月(\d+)日現在.*\"(\d+)年(\d+)月(\d+)日現在/
            line.sub(/(\d+)年(\d+)月(\d+)日現在.*\"(\d+)年(\d+)月(\d+)日現在/) do
                year1 = $1
                month1 = $2
                year2 = $4
                month2 = $5
            end
            STDERR.puts "#{file}: #{$1}:#{year1}-#{month1}, #{$4}:#{year2}-#{month2}"
        elsif line =~ /(\d+)年(\d+)月1日現在|^時間軸コード/
            csvtext += line
        elsif line =~ /総   数| ～ |100歳以上.*and over|85歳以上.*and over/
            if $firstflag
                csvtext += "人口区分,時点,年齢階級,区分,単位,男女計,男,女\n"
                $firstflag = false
            end

            #"総   数",,Total,12571,6118,6453,,125836,61226,64610,123352,59991,63361
            #    |
            #    V
            #総人口,2023年11月1日現在（概算値）,総数,人口,万人,12431,6047,6384
            items =  line.split(/,/)
            age = items[0].gsub(/ |　/,'').gsub(/"/,'')
            if age =~ /0～4歳/
                age = '0歳～4歳'
            elsif age !~ /総数/ && age !~ /歳/
                age.gsub!(/(\d+)/, '\1歳')
            end
            #puts "#{items[0]}: #{age}"
            if ! $flipflag
                csvtext += "総人口,#{year1}年#{month1}月1日現在（概算値）,#{age},人口,万人,#{items[3]},#{items[4]},#{items[5]}\n"
                csvtext += "総人口,#{year2}年#{month2}月1日現在（確定値）,#{age},人口,千人,#{items[7]},#{items[8]},#{items[9]}\n"
                csvtext += "日本人人口,#{year2}年#{month2}月1日現在（確定値）,#{age},人口,千人,#{items[10]},#{items[11]},#{items[12]}"
            else
                csvtext += "総人口,#{year1}年#{month1}月1日現在（概算値）,#{age},人口,万人,#{items[10]},#{items[11]},#{items[12]}"
                csvtext += "総人口,#{year2}年#{month2}月1日現在（確定値）,#{age},人口,千人,#{items[3]},#{items[4]},#{items[5]}\n"
                csvtext += "日本人人口,#{year2}年#{month2}月1日現在（確定値）,#{age},人口,千人,#{items[6]},#{items[7]},#{items[8]}\n"
            end
        end
    end

    #STDERR.print csvtext
    #exit

    $firstflag = true
    CSV.parse(csvtext, headers: true).each do |row0|
        row = row0.to_h
        #pp row
        row['時点'].gsub(/(\d+)年(\d+)月1日現在（(.*)）/) do
            year = $1
            month = sprintf('%02d', $2)
            type = $3
        end
        #pp $1, $2, $3

        type = 'conf'
        if row['時点'] =~ /概算値/
            type = 'est'
        end

        if row['人口区分'] =~ /日本人人口/
            type = 'jpns'
        end
        next if row['区分'] != '人口' || ! (age = $ages[row['年齢階級']])
        $sexes.each do |k, v|
            id = "jpn_#{year}m#{month}_pop__#{type}__#{v}"
            if ! $health[id]
                $health[id] = {
                    id: id,
                    category: 'pop',
                    loc_code: 'jpn',
                    location: 'Japan',
                    date: "#{year}-#{month}-01",
                    yearmonth: "#{year}m#{month}",
                    year: year,
                    month: month,
                    sex: v,
                    type: type,
                    age_all: '', age_00_04: '', age_05_09: '', age_10_14: '', age_15_19: '', age_20_24: '', age_25_29: '', age_30_34: '', age_35_39: '', age_40_44: '', age_45_49: '', age_50_54: '', age_55_59: '', age_60_64: '', age_65_69: '', age_70_74: '', age_75_79: '', age_80_84: '', age_85_89: '', age_85over: '', age_90_94: '', age_95_99: '', age_100over: '',
                }
            end
            #pp id, age, k, row[k]
            if row['単位'] == '万人'
                $health[id][age.to_sym] = row[k].to_i * 10000
            elsif row['単位'] == '千人'
                $health[id][age.to_sym] = row[k].to_i * 1000
            end
            #pp $health[id]
       end
    end
end
#pp $health

Mstats2026.output($health)
